#pragma once
/*
Второе заданиеРеализовать полнофункциональную систему тестирования.В системе должны быть реализовано 2 режима:
■Администратор;
■Тестируемый.

Описание режима работа для Тестируемого (в дальнейшем гость)
Для входа в систему гость должен зарегистрироваться. 
Данная процедура вы-полняется один раз, при дальнейших входах в систему доступ идет по логину и паролю.
При регистрации нужно указывать ФИО, домашний адрес, телефон.
Важно, чтобы логины для пользователей были уникальными.
После входа гость имеет возможность просмотреть свои предыдущие резуль-таты тестирования, сдать новое тестирование.
Тестирование может осуществляться по различным категориям знаний. 
Например:Математика (раздел) –> Дискретная математика (конкретный тест);  –> Математический анализ (конкретный тест).
Физика (раздел) –> Квантовая физика (конкретный тест);–> Механика (конкретный тест).
После сдачи теста гость видит результат тестирования, количество правильно отвеченных вопросов, процент правильных ответов и полученную оценку.
Студент имеет возможность прервать тестирование и продолжить его тогда, когда ему это будет удобно.
Оценивание нужно вести на основании 12-балльной системы, привязанной к количеству вопросов теста.
Пароли и логины гостей хранятся в зашифрованном виде.


*/


/*
https://docs.microsoft.com/ru-ru/cpp/cpp/override-specifier?view=msvc-170
*/